app/controllers/items_controller.rb

def admin_create
  @item = Item.new(item_params)
  if @item.save
---
INSERT INTO "items" ("title", "description", "price", "stock", "created_at", "updated_at") VALUES ('ニット帽', '', NULL, NULL, '2026-03-31 01:28:30.328895', '2026-03-31 01:28:30.328895') RETURNING "id"

  def index
    @items = Item.all || [] # データが無ければ空配列
---
SELECT "items".* FROM "items"

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("title", "description", "price", "stock", "created_at", "updated_at") VALUES ('ニット帽', '', NULL, NULL, '2026-03-31 01:28:30.328895', '2026-03-31 01:28:30.328895') RETURNING "id"